#include<stdio.h>
#include<locale.h>
#include<math.h>
int main() {
	setlocale(LC_ALL, "rus");
	float x1 = 0, y1 = 0, x2 = 0, y2 = 0, x3 = 0, y3 = 0, P = 0, S = 0, a = 0, b = 0, c = 0, pm = 0;
	printf("Добро пожаловать в программу для вычисления площади и периметра треугольника по координатам его вершин\nВведите координаты первой вершины в формате (x1;y1)\n");
	scanf_s("%f;%f", &x1, &y1);
	printf("Введите координаты второй вершины в формате (x2;y2)\n");
	scanf_s("%f;%f", &x2, &y2);
	printf("Введите координаты третьей вершины в формате (x3;y3)\n");
	scanf_s("%f;%f", &x3, &y3);
	a = pow(((x1 - x2) * (x1 - x2) + (y1 - y2) * (y1 - y2)), 0.5);
	b = pow(((x2 - x3) * (x2 - x3) + (y2 - y3) * (y2 - y3)), 0.5);
	c = pow(((x1 - x3) * (x1 - x3) + (y1 - y3) * (y1 - y3)), 0.5);
	P = a + b + c;
	pm = P / 2;
	S = sqrt(pm * (pm - a) * (pm - b) * (pm - c));
	printf("Площадь треугольника равна %.2f\nПериметр треугольника равен %.2f\n", S, P);
	system("pause");
}